{"scoring":null,"notes":"Заметьте, что так как ребра ориентированные, их выводить нужно в следующем порядке: ребро $(u, v)$ означает, что сотрудник $u$ является начальником сотрудника $v$.\r\n\r\nРешения, работающие при $n \\leq 1000$ набирают до 40 баллов","legend":"Вы проходите собеседование в одну крупную компанию, иерархия этой компании представляет собой Двоичное дерево. Но с маленькой особенностью: у сотрудника может быть либо 2 непосредственных подчинённых, либо 0.\r\n\r\nУ каждого сотрудника в этой компании есть показатель высоты, высота сотрудника $i$ - это максимальное расстояние до его подчиненного (любой подчиненный вашего подчиненного - тоже ваш подчиненный). \r\n\r\nСобеседуют вас босс компании и два его зама, которые определяются как два самых высоких подчиненных босса, причем высота первого зама всегда не меньше высоты второго. Босс никому не подчиняется.\r\n\r\nВас попросили по четырем числам восстановить возможную картину иерархии в этой компании, дав вам $n$ - общее количество сотрудников в компании, $h_1$ - высота босса, $h_2$ - высота первого зама, $h_3$ - высота второго зама.\r\n\r\nЕсли такая иерархия возможна - вам необходимо предоставить двоичное дерево, с корнем в вершине 1, где корень соответствует боссу компании. Справитесь ли вы с этой задачей?","authorLogin":"nomapunk","language":"russian","timeLimit":1000,"output":"Если такая иерархия существует - выведите YES, затем количество ребер, а потом и сами ребра, описывающие двоичное дерево с корнем в вершине 1. Иначе выведите NO, если не существует такой иерархии.","inputFile":"stdin","outputFile":"stdout","input":"Вводится четыре числа $n, h_1, h_2, h_3$, $3 \\leq n \\leq 10^6$, $0 \\leq h_1, h_2, h_3, \\leq 10^6$","authorName":"Саша Драганов","sampleTests":[{"output":"YES\r\n2\r\n1 2\r\n1 3","input":"3 1 0 0","inputFile":"example.01","outputFile":"example.01.a"},{"output":"NO","input":"11 1 0 0\r\n","inputFile":"example.02","outputFile":"example.02.a"}],"name":"Boss","interaction":null,"memoryLimit":268435456,"tutorial":""}